blog/mpv-playlist-manager.org
#+include: templates/header.org
#+date: 11-02-2021 (d-m-y)

* A simple youtube bookmark player with raku, mpv and dmenu
  :PROPERTIES:
      :header-args:raku+: :comments no
      :header-args:raku+: :eval no
      :header-args:raku+: :results none
      :header-args:raku+: :exports code
  :END:
  
** Introduction
This document explains in a pedagogical way how to write
a simple music/video bookmark player with the programming language [[https://raku.org][raku]].

I often find myself discovering nice music on youtube and wanting to recover
or replay it later.
Of course I could use a bookmark manager but I want an easy fuzzy searching
and storing the links in an [[https://orgmode.org][org-mode]] file.

Instead of writing quickly the script and adding it to my script collections, 
I thought this time I can show how convenient and fun ~raku~ can be in scripting
these kind of small applications.

Do not worry if you don't understand everything here, it is also meant as
a teaser so that you go and learn some raku yourself! I think that raku at least
for scripting is highly underrated.

So let's get to it!

** Main

Raku lets you define a ~MAIN~ function globally where your program starts.
I like to do this in simple scripts and then it's out of the way.

#+begin_src raku :noweb-ref main-script
#| A simple playlist manager
unit sub MAIN();
#+end_src

Notice that just with this line your application already has an argument parser
predefined, i.e., if I name the script =,yt=, as I have, then

#+begin_src sh :eval no
,yt -h
#+end_src

results in

#+begin_example
Usage:
  ,yt -- A simple playlist manager
#+end_example

You can do much more with this default parser, but for our simple script we do not need it.

In my case, I will store the links to the songs or playlists in an =org-mode= file,
in your case you might decide otherwise.

I will store the location to my org file in the constant
=$ORG_LINK_FILE=:
#+begin_src raku :noweb-ref main-script
constant $ORG_LINK_FILE = "%*ENV<HOME>/.config/org/yt-playlists.org";
#+end_src

** Links
We would like to parse the =org-mode= links appearing in the playlist file,
an /named/ =org-mode= link looks like this

#+begin_src text
[[URL][My long and complicated title]]
#+end_src

Let us define a ~Link~ data structure in a class

#+begin_src raku :noweb-ref main-script
class Link {
  has Str $.name;
  has Str $.url;
  has Str $.tags;
}
#+end_src

Raku has Regexes and Grammars as first-class citizens in the language, let us define a
simple regex for an ~org-mode~ link

#+begin_src raku :noweb-ref main-script
my regex org-mode-link {
  "[["
    $<url> = <-[\]]>+
  "]["
    $<name> = <-[\]]>+
  "]]"
}
#+end_src

notice how convenient it is to define a named regular expression in raku.
=$<url>= and =$<name>= are a named-captures that will be helpful later on,
for more information consult the [[https://docs.raku.org/language/regexes#index-entry-declarator_regex-Subrules][raku documentation]].

However, in general I will have my url in a section's header, and in =org-mode=
you can add tags to headers. Therefore I would also like to parse these tags
so that I can match the titles easier, the general form of a title
in ~org-mode~ is

#+begin_src text
 * [[url][My long and complicated title]]                            :some:tags:
#+end_src

A simple regular expression matching the tags **for our purposes** is simply

#+begin_src raku :noweb-ref main-script
my regex org-tags {
  ":" .* ":" $$
}
#+end_src

where ~$$~ denotes the end of a line.


