blog/mpv-playlist-manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-13 Sat 21:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alejandro Gallo" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
</head>
<body>
<div id="content">
<style type="text/css">
nav {
  position: relative;
  top: 0;
}
nav > a:hover {
  color: red;
}
</style>

<nav>
  <a href="/"> HOME </a>
  <a href="/blog"> BLOG </a>
  <a href="/about.html"> ABOUT </a>
</nav>

<div id="outline-container-orgf994ff6" class="outline-2">
<h2 id="orgf994ff6">A simple youtube bookmark player with raku, mpv and dmenu</h2>
<div class="outline-text-2" id="text-orgf994ff6">
</div>

<div id="outline-container-org218a158" class="outline-3">
<h3 id="org218a158">Introduction</h3>
<div class="outline-text-3" id="text-org218a158">
<p>
This document explains in a pedagogical way how to write
a simple music/video bookmark player with the programming language <a href="https://raku.org">raku</a>.
</p>

<p>
I often find myself discovering nice music on youtube and wanting to recover
or replay it later.
Of course I could use a bookmark manager but I want an easy fuzzy searching
and storing the links in an <a href="https://orgmode.org">org-mode</a> file.
</p>

<p>
Instead of writing quickly the script and adding it to my script collections, 
I thought this time I can show how convenient and fun <code>raku</code> can be in scripting
these kind of small applications.
</p>

<p>
Do not worry if you don't understand everything here, it is also meant as
a teaser so that you go and learn some raku yourself! I think that raku at least
for scripting is highly underrated.
</p>

<p>
So let's get to it!
</p>
</div>
</div>

<div id="outline-container-orgd762a78" class="outline-3">
<h3 id="orgd762a78">Main</h3>
<div class="outline-text-3" id="text-orgd762a78">
<p>
Raku lets you define a <code>MAIN</code> function globally where your program starts.
I like to do this in simple scripts and then it's out of the way.
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a0a1a7;">#| A simple playlist manager</span>
<span style="color: #383a42; background-color: #fafafa;">unit</span> <span style="color: #a626a4;">sub</span> <span style="color: #383a42; background-color: #fafafa;">MAIN</span>()<span style="color: #e44649;">;</span>
</pre>
</div>

<p>
Notice that just with this line your application already has an argument parser
predefined, i.e., if I name the script <code>,yt</code>, as I have, then
</p>

<div class="org-src-container">
<pre class="src src-sh">,yt -h
</pre>
</div>

<p>
results in
</p>

<pre class="example">
Usage:
  ,yt -- A simple playlist manager
</pre>

<p>
You can do much more with this default parser, but for our simple script we do not need it.
</p>

<p>
In my case, I will store the links to the songs or playlists in an <code>org-mode</code> file,
in your case you might decide otherwise.
</p>

<p>
I will store the location to my org file in the constant
<code>$ORG_LINK_FILE</code>:
</p>
<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">constant</span> <span style="color: #8b4513;">$</span><span style="color: #8b4513;">ORG_LINK_FILE</span> <span style="color: #e44649;">=</span> <span style="color: #e44649;">"</span><span style="color: #50a14f;">%*ENV</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">HOME</span><span style="color: #e44649;">&gt;</span><span style="color: #50a14f;">/.config/org/yt-playlists.org</span><span style="color: #e44649;">";</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a9fa55" class="outline-3">
<h3 id="org4a9fa55">Links</h3>
<div class="outline-text-3" id="text-org4a9fa55">
<p>
We would like to parse the <code>org-mode</code> links appearing in the playlist file,
an <i>named</i> <code>org-mode</code> link looks like this
</p>

<div class="org-src-container">
<pre class="src src-text">[[URL][My long and complicated title]]
</pre>
</div>

<p>
Let us define a <code>Link</code> data structure in a class
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">class</span> <span style="color: #383a42; background-color: #fafafa;">Link</span> {
  <span style="color: #a626a4;">has</span> <span style="color: #c18401;">Str</span> <span style="color: #8b4513;">$</span><span style="color: #c18401;">.</span><span style="color: #8b4513;">name</span><span style="color: #e44649;">;</span>
  <span style="color: #a626a4;">has</span> <span style="color: #c18401;">Str</span> <span style="color: #8b4513;">$</span><span style="color: #c18401;">.</span><span style="color: #8b4513;">url</span><span style="color: #e44649;">;</span>
  <span style="color: #a626a4;">has</span> <span style="color: #c18401;">Str</span> <span style="color: #8b4513;">$</span><span style="color: #c18401;">.</span><span style="color: #8b4513;">tags</span><span style="color: #e44649;">;</span>
}
</pre>
</div>

<p>
Raku has Regexes and Grammars as first-class citizens in the language, let us define a
simple regex for an <code>org-mode</code> link
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">my</span> <span style="color: #383a42; background-color: #fafafa;">regex</span> <span style="color: #383a42; background-color: #fafafa;">org-mode-link</span> {
  <span style="color: #e44649;">"</span><span style="color: #50a14f;">[[</span><span style="color: #e44649;">"</span>
    <span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">url</span><span style="color: #e44649;">&gt;</span> <span style="color: #e44649;">=</span> <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">-[\]]</span><span style="color: #e44649;">&gt;+</span>
  <span style="color: #e44649;">"</span><span style="color: #50a14f;">][</span><span style="color: #e44649;">"</span>
    <span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">name</span><span style="color: #e44649;">&gt;</span> <span style="color: #e44649;">=</span> <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">-[\]]</span><span style="color: #e44649;">&gt;+</span>
  <span style="color: #e44649;">"</span><span style="color: #50a14f;">]]</span><span style="color: #e44649;">"</span>
}
</pre>
</div>

<p>
notice how convenient it is to define a named regular expression in raku.
<code>$&lt;url&gt;</code> and <code>$&lt;name&gt;</code> are a named-captures that will be helpful later on,
for more information consult the <a href="https://docs.raku.org/language/regexes#index-entry-declarator_regex-Subrules">raku documentation</a>.
</p>

<p>
However, in general I will have my url in a section's header, and in <code>org-mode</code>
you can add tags to headers. Therefore I would also like to parse these tags
so that I can match the titles easier, the general form of a title
in <code>org-mode</code> is
</p>

<div class="org-src-container">
<pre class="src src-text"> * [[url][My long and complicated title]]                            :some:tags:
</pre>
</div>

<p>
A simple regular expression matching the tags <b><b>for our purposes</b></b> is simply
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">my</span> <span style="color: #383a42; background-color: #fafafa;">regex</span> <span style="color: #383a42; background-color: #fafafa;">org-tags</span> {
  <span style="color: #e44649;">"</span><span style="color: #50a14f;">:</span><span style="color: #e44649;">"</span> <span style="color: #e44649;">.*</span> <span style="color: #e44649;">"</span><span style="color: #50a14f;">:</span><span style="color: #e44649;">"</span> $<span style="color: #8b4513;">$</span>
}
</pre>
</div>

<p>
where <code>$$</code> denotes the end of a line.
</p>
</div>
</div>
