blog/mpv-playlist-manager.org
** Picking with dmenu
We will be using [[http://tools.suckless.org/dmenu/][dmenu]] as a pick tool, so we should write
a function that accepts a list of links and asks for user input
via dmenu returning a list of selected links.

We can define a function in raku using the ~sub~ keyword,
so in our case the function would look like this

#+begin_src raku :noweb no-export :noweb-ref main-script
sub dmenu-link (Link @links) of Array[Link] {
  <<dmenu-title>>
  <<dmenu-link-contents>>
}
#+end_src

This says, accept as an argument a list of ~Link~ and return an ~Array~
of ~Link~.

We can define an duck-typed helper function that takes 
a ~Link~ as an input and returns the text that ~dmenu~ will
see and offer to the user, in raku we can simply write

=<<dmenu-title>>==
#+begin_src raku :noweb-ref dmenu-title :tangle no
my &dmenu-title = {"{.name} {.tags}"};
#+end_src

In order to feed the text to dmenu we can create a temporary
file where we will put all the titles of the entries
and then feed to the dmenu process its contents through
the ~stdin~ file descriptor:

=<<dmenu-link-contents>>==
#+begin_src raku :noweb-ref dmenu-link-contents :tangle no
with "/tmp/,yt.in".IO.open: :rw {
  .say: @links».&dmenu-title.join: "\n";
  .close and .open; # we need to close and open, maybe improve?
  my Str $name = .out.slurp.chomp
                  given shell "dmenu -i", :in($_), :out;
  Array[Link].new: @links.grep: {.&dmenu-title eq $name}
}
#+end_src


