blog/mpv-playlist-manager.html


<div id="outline-container-org822cc32" class="outline-3">
<h3 id="org822cc32">Picking with dmenu</h3>
<div class="outline-text-3" id="text-org822cc32">
<p>
We will be using <a href="http://tools.suckless.org/dmenu/">dmenu</a> as a pick tool, so we should write
a function that accepts a list of links and asks for user input
via dmenu returning a list of selected links.
</p>

<p>
We can define a function in raku using the <code>sub</code> keyword,
so in our case the function would look like this
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">sub</span> <span style="color: #383a42; background-color: #fafafa;">dmenu-link</span> (<span style="color: #383a42; background-color: #fafafa;">Link</span> <span style="color: #8b4513;">@</span><span style="color: #8b4513;">links</span>) <span style="color: #e44649;">of</span> <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link]</span> {
  <span style="color: #e44649;">&lt;&lt;dmenu-title&gt;&gt;</span>
  <span style="color: #e44649;">&lt;&lt;dmenu-link-contents&gt;&gt;</span>
}
</pre>
</div>

<p>
This says, accept as an argument a list of <code>Link</code> and return an <code>Array</code>
of <code>Link</code>.
</p>

<p>
We can define an duck-typed helper function that takes 
a <code>Link</code> as an input and returns the text that <code>dmenu</code> will
see and offer to the user, in raku we can simply write
</p>

<p>
<code>&lt;&lt;dmenu-title&gt;&gt;=</code>
</p>
<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">my</span> <span style="color: #8b4513;">&amp;</span><span style="color: #8b4513;">dmenu-title</span> <span style="color: #e44649;">=</span> {<span style="color: #e44649;">"</span><span style="color: #50a14f;">{.name} {.tags}</span><span style="color: #e44649;">"</span>}<span style="color: #e44649;">;</span>
</pre>
</div>

<p>
In order to feed the text to dmenu we can create a temporary
file where we will put all the titles of the entries
and then feed to the dmenu process its contents through
the <code>stdin</code> file descriptor:
</p>

<p>
<code>&lt;&lt;dmenu-link-contents&gt;&gt;=</code>
</p>
<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">with</span> <span style="color: #e44649;">"</span><span style="color: #50a14f;">/tmp/,yt.in</span><span style="color: #e44649;">".</span><span style="color: #383a42; background-color: #fafafa;">IO</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">open</span><span style="color: #e44649;">:</span> <span style="color: #e44649;">:</span><span style="color: #50a14f;">rw</span> {
  <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">say</span><span style="color: #e44649;">:</span> <span style="color: #8b4513;">@</span><span style="color: #8b4513;">links</span><span style="color: #e44649;">&#187;.</span><span style="color: #8b4513;">&amp;</span><span style="color: #8b4513;">dmenu-title</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">join</span><span style="color: #e44649;">:</span> <span style="color: #e44649;">"</span><span style="color: #50a14f;">\n</span><span style="color: #e44649;">";</span>
  <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">close</span> <span style="color: #e44649;">and</span> <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">open</span><span style="color: #e44649;">;</span> <span style="color: #a0a1a7;"># we need to close and open, maybe improve?</span>
  <span style="color: #a626a4;">my</span> <span style="color: #c18401;">Str</span> <span style="color: #8b4513;">$</span><span style="color: #8b4513;">name</span> <span style="color: #e44649;">=</span> <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">out</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">slurp</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">chomp</span>
                  <span style="color: #a626a4;">given</span> <span style="color: #383a42; background-color: #fafafa;">shell</span> <span style="color: #e44649;">"</span><span style="color: #50a14f;">dmenu -i</span><span style="color: #e44649;">",</span> <span style="color: #e44649;">:</span><span style="color: #383a42; background-color: #fafafa;">in</span>(<span style="color: #8b4513;">$</span><span style="color: #8b4513;">_</span>)<span style="color: #e44649;">,</span> <span style="color: #e44649;">:</span><span style="color: #50a14f;">out</span><span style="color: #e44649;">;</span>
  <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link].</span><span style="color: #383a42; background-color: #fafafa;">new</span><span style="color: #e44649;">:</span> <span style="color: #8b4513;">@</span><span style="color: #8b4513;">links</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">grep</span><span style="color: #e44649;">:</span> {<span style="color: #e44649;">.</span><span style="color: #8b4513;">&amp;</span><span style="color: #8b4513;">dmenu-title</span> <span style="color: #e44649;">eq</span> <span style="color: #8b4513;">$</span><span style="color: #8b4513;">name</span>}
}
</pre>
</div>
</div>
</div>
