blog/mpv-playlist-manager.org
** Parsing the ~org-mode~ link file

Let us define the function that will parse the org file and return an =Array= of links.
In this function we use the [[https://docs.raku.org/syntax/gather%20take][=gather=]] syntax provided by raku, which simplifies
in this case the building of the resulting array.

Essentially, we simply go through the lines of =$ORG_LINK_FILE=
and =take= a =Link= only when the line matches

=<<parse-org-regex>>==
#+begin_src raku :noweb-ref parse-org-regex :tangle no
<org-mode-link> [\s+ <org-tags>]?
#+end_src

Notice that in raku we can trigger the evaluation of a code
whenever a regular expression matches by
embedding the code inside the regular expression in a code block.
In this case this looks like this:

=<<parse-links-regex>>==
#+begin_src raku :noweb-ref parse-links-regex :tangle no :noweb no-export
/ <<parse-org-regex>>
  { take
      Link.new: |hash
        <name url tags>
        Z=>
        ( |$<org-mode-link><name url>
        , $<org-tags>
        )».&{.so ?? .Str !! ""}
  }
/
#+end_src

If this seems like [[https://www.perl.com/pub/2000/01/10PerlMyths.html/#Perl_looks_like_line_noise][line noise]] to you, it is normal and I am sorry.
However, I think it is part of the fun writing and learning raku.
Of course one should write differently if it is meant to be understood
by everyone in a team, but for your private short scripts like this one
you may experiment with what the language has to offer.
However, you can go **way** wilder than this..
I'll leave it as an exercise to decipher this bit!

With this, our parsing function looks simply like:

#+begin_src raku :noweb no-export :noweb-ref def-parse-link
sub parse-links (--> Array[Link]) {
  Array[Link].new:
    gather
      for $ORG_LINK_FILE.IO.lines {
        .match:
        <<parse-links-regex>>
      }
}
#+end_src

or expanding all the code to see it in full

#+begin_src raku :noweb yes :tangle no :noweb-ref main-script
<<def-parse-link>>
#+end_src


