blog/mpv-playlist-manager.html


<div id="outline-container-orgdcda050" class="outline-3">
<h3 id="orgdcda050">Parsing the <code>org-mode</code> link file</h3>
<div class="outline-text-3" id="text-orgdcda050">
<p>
Let us define the function that will parse the org file and return an <code>Array</code> of links.
In this function we use the <a href="https://docs.raku.org/syntax/gather%20take"><code>gather</code></a> syntax provided by raku, which simplifies
in this case the building of the resulting array.
</p>

<p>
Essentially, we simply go through the lines of <code>$ORG_LINK_FILE</code>
and <code>take</code> a <code>Link</code> only when the line matches
</p>

<p>
<code>&lt;&lt;parse-org-regex&gt;&gt;=</code>
</p>
<div class="org-src-container">
<pre class="src src-raku"><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-mode-link</span><span style="color: #e44649;">&gt;</span> [<span style="color: #e44649;">\</span><span style="color: #383a42; background-color: #fafafa;">s</span><span style="color: #e44649;">+</span> <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-tags</span><span style="color: #e44649;">&gt;</span>]<span style="color: #e44649;">?</span>
</pre>
</div>

<p>
Notice that in raku we can trigger the evaluation of a code
whenever a regular expression matches by
embedding the code inside the regular expression in a code block.
In this case this looks like this:
</p>

<p>
<code>&lt;&lt;parse-links-regex&gt;&gt;=</code>
</p>
<div class="org-src-container">
<pre class="src src-raku"><span style="color: #e44649;">/</span> <span style="color: #e44649;">&lt;&lt;parse-org-regex&gt;&gt;</span>
  { <span style="color: #a626a4;">take</span>
      <span style="color: #383a42; background-color: #fafafa;">Link</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">new</span><span style="color: #e44649;">:</span> <span style="color: #e44649;">|hash</span>
        <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">name url tags</span><span style="color: #e44649;">&gt;</span>
        <span style="color: #e44649;">Z=&gt;</span>
        ( <span style="color: #e44649;">|</span><span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-mode-link</span><span style="color: #e44649;">&gt;&lt;</span><span style="color: #50a14f;">name url</span><span style="color: #e44649;">&gt;</span>
        <span style="color: #e44649;">,</span> <span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-tags</span><span style="color: #e44649;">&gt;</span>
        )<span style="color: #e44649;">&#187;.&amp;</span>{<span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">so</span> <span style="color: #e44649;">??</span> <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">Str</span> <span style="color: #e44649;">!!</span> <span style="color: #e44649;">""</span>}
  }
<span style="color: #e44649;">/</span>
</pre>
</div>

<p>
If this seems like <a href="https://www.perl.com/pub/2000/01/10PerlMyths.html/#Perl_looks_like_line_noise">line noise</a> to you, it is normal and I am sorry.
However, I think it is part of the fun writing and learning raku.
Of course one should write differently if it is meant to be understood
by everyone in a team, but for your private short scripts like this one
you may experiment with what the language has to offer.
However, you can go <b><b>way</b></b> wilder than this..
I'll leave it as an exercise to decipher this bit!
</p>

<p>
With this, our parsing function looks simply like:
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">sub</span> <span style="color: #383a42; background-color: #fafafa;">parse-links</span> (<span style="color: #e44649;">--&gt;</span> <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link]</span>) {
  <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link].</span><span style="color: #383a42; background-color: #fafafa;">new</span><span style="color: #e44649;">:</span>
    <span style="color: #a626a4;">gather</span>
      <span style="color: #a626a4;">for</span> <span style="color: #8b4513;">$</span><span style="color: #8b4513;">ORG_LINK_FILE</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">IO</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">lines</span> {
        <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">match</span><span style="color: #e44649;">:</span>
        <span style="color: #e44649;">&lt;&lt;parse-links-regex&gt;&gt;</span>
      }
}
</pre>
</div>

<p>
or expanding all the code to see it in full
</p>

<div class="org-src-container">
<pre class="src src-raku"><span style="color: #a626a4;">sub</span> <span style="color: #383a42; background-color: #fafafa;">parse-links</span> (<span style="color: #e44649;">--&gt;</span> <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link]</span>) {
  <span style="color: #c18401;">Array</span><span style="color: #e44649;">[Link].</span><span style="color: #383a42; background-color: #fafafa;">new</span><span style="color: #e44649;">:</span>
    <span style="color: #a626a4;">gather</span>
      <span style="color: #a626a4;">for</span> <span style="color: #8b4513;">$</span><span style="color: #8b4513;">ORG_LINK_FILE</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">IO</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">lines</span> {
        <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">match</span><span style="color: #e44649;">:</span>
        <span style="color: #e44649;">/</span> <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-mode-link</span><span style="color: #e44649;">&gt;</span> [<span style="color: #e44649;">\</span><span style="color: #383a42; background-color: #fafafa;">s</span><span style="color: #e44649;">+</span> <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-tags</span><span style="color: #e44649;">&gt;</span>]<span style="color: #e44649;">?</span>
          { <span style="color: #a626a4;">take</span>
              <span style="color: #383a42; background-color: #fafafa;">Link</span><span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">new</span><span style="color: #e44649;">:</span> <span style="color: #e44649;">|hash</span>
                <span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">name url tags</span><span style="color: #e44649;">&gt;</span>
                <span style="color: #e44649;">Z=&gt;</span>
                ( <span style="color: #e44649;">|</span><span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-mode-link</span><span style="color: #e44649;">&gt;&lt;</span><span style="color: #50a14f;">name url</span><span style="color: #e44649;">&gt;</span>
                <span style="color: #e44649;">,</span> <span style="color: #8b4513;">$</span><span style="color: #e44649;">&lt;</span><span style="color: #50a14f;">org-tags</span><span style="color: #e44649;">&gt;</span>
                )<span style="color: #e44649;">&#187;.&amp;</span>{<span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">so</span> <span style="color: #e44649;">??</span> <span style="color: #e44649;">.</span><span style="color: #383a42; background-color: #fafafa;">Str</span> <span style="color: #e44649;">!!</span> <span style="color: #e44649;">""</span>}
          }
        <span style="color: #e44649;">/</span>
      }
}
</pre>
</div>
</div>
</div>
